Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Once you are happy with things it is recommended that you create and place your own graphic in its area.
zh_cn: 一旦你对事物感到满意，建议你在它的区域创建并放置你自己的图形。

source: Once you call this command the primitive can be used in the vertex_submit() function for use in a shader or you can freeze the buffer (making the vertex buffer used read-only and much faster) using vertex_freeze().
zh_cn: 一旦你调用了这个命令，图元就可以在vertex_submit()函数中使用，或者你可以使用vertex_freeze()来冻结缓冲区(使顶点缓冲区只读并且更快)。

source: Once you have added audio from a buffer to a queue, the buffer cannot be deleted until you have first freed the queue using the function audio_free_play_queue(), and the buffer properties should match those of the the queue that you are adding the sound to.
zh_cn: 一旦将音频从缓冲区添加到队列中，在使用函数audio_free_play_queue()释放队列之前，不能删除缓冲区，并且缓冲区属性应该与要添加声音的队列的属性相匹配。

source: Once you have assigned a skeletal animation sprite to your instance, you can then define which animation set it should use at any given time with this function.
zh_cn: 一旦你给你的实例分配了一个骨骼动画精灵，你就可以用此函数定义它在任何给定的时间应该使用哪个动画集。

source: Once you have created the camera you can then use the different matrix functions to set the view and projection matrices.
zh_cn: 一旦你创建了相机，你就可以使用不同的矩阵函数来设置视图和投影矩阵。

source: Once you have created your fixture you can define it as being part of a collision group.
zh_cn: 创建了夹具之后，可以将其定义为碰撞组的一部分。

source: Once you have created your virtual key for your devices, you may need to debug and test that it is correctly positioned and working properly and for that you would call the function virtual_key_show().
zh_cn: 一旦为设备创建了虚拟键，您可能需要调试并测试它是否正确定位并正常工作，为此您可以调用函数virtual_key_show()。

source: Once you have created your virtual key for your devices, you may need to debug and test that it is correctly positioned and working properly.
zh_cn: 一旦您为设备创建了虚拟键，您可能需要调试和测试它的位置是否正确以及工作是否正常。

source: Once you have done your calculations using sin, or cos etc... the result is in radians.
zh_cn: 一旦你用sin或cos等完成了计算...结果以弧度表示。

source: Once you have finished using the path, or wish to create a new one and store its index in the same variable you should first delete the old path with path_delete to prevent memory leaks which can eventually crash your game.
zh_cn: 一旦你使用完了路径，或者想创建一个新的路径并把它的索引存储在同一个变量中，你应该首先用path_delete删除旧的路径，以防止内存泄漏，这最终会使你的游戏崩溃。

source: Once you have finished working with a given file (whether reading from it or writing to it), you must close the file again, or else you risk losing the information contained within.
zh_cn: 一旦您完成了对给定文件的操作(无论是从其中读取还是写入)，您必须再次关闭该文件，否则您可能会丢失其中所包含的信息。

source: One important thing to understand about this function is that if you call it right at the start of the game, before the initial frame is rendered (ie: the Create Event of the first object in the first room of the game), then the game window will not be rendered.
zh_cn: 关于此函数需要理解的一件重要的事情是，如果你在游戏开始时调用它，在初始帧被渲染之前(例如:在游戏的第一个房间中第一个对象的创建事件)，那么游戏窗口将不会被渲染。

source: One of the 16 available user events.
zh_cn: 16个可用用户事件之一。

source: One of the actions listed under 'Other'
zh_cn: "其他"下列出的操作之一

source: One of the constants listed below will be returned.
zh_cn: 将返回下面列出的常量之一。

source: One of the simplest joint is a distance joint which says that the distance between two points on two instances must be constant.
zh_cn: 最简单的连接之一是距离连接，它表示两个实例上两点之间的距离必须是常量。

source: One use for this is for filtering words that may be considered offensive, or for finding the correct place to insert some text into another string.
zh_cn: 它的一个用途是过滤可能被认为是冒犯性的单词，或者找到将一些文本插入另一个字符串的正确位置。

source: Only triggered at the end of a room
zh_cn: 仅在房间尽头触发

source: Only triggered at the end of the game
zh_cn: 仅在游戏结束时触发

source: Only triggered at the start of a room
zh_cn: 仅在房间开始时触发

source: Only triggered at the start of the game
zh_cn: 仅在游戏开始时触发

source: Opera
zh_cn: 欧朋 Opera

source: Optional flags to affect how the data is sent.
zh_cn: 影响数据发送方式的可选标志。

source: Optional!
zh_cn: 可选！

source: Optionally a 4th w parameter can be passed in.
zh_cn: 可选地，可以传入第4个w参数。

source: Or if you perform an alarm event, the alarm counter will not be set to -1 but rather continue to count down.
zh_cn: 或者，如果您执行一个警报事件，警报计数器将不会被设置为-1，而是继续倒计时。

source: Packets sent with this function are formatted such that the GameMaker game receiving the data can "split" the packets correctly, and the function will return the number of bytes of data sent, or a number less than 0 if the send has failed.
zh_cn: 使用此函数发送的数据包被格式化，以便接收数据的GameMaker游戏能够正确地"分割"数据包，函数将返回发送的数据的字节数，如果发送失败，则返回小于0的数字。

source: Parameters not specified will fall back to their default values/behaviour.
zh_cn: 未指定的参数将回退到其默认值/行为。

source: Particles created with this flag are "connected" in pairs, with each particle being connected to the one that was closest to it at the time of creation.
zh_cn: 使用此标志创建的粒子成对"连接",每个粒子都连接到创建时离它最近的粒子。

source: Path points are numbered from 0 so the first point is always the 0th point and the last path point will be path_get_number() - 1.
zh_cn: 路径点从0开始编号，因此第一个点始终是第0个点，最后一个路径点将是path_get_number() - 1。

source: Paths can be either smooth or straight (a smooth path calculates a curved path around the defining points, whereas a straight path just goes straight from one point to another).
zh_cn: 路径可以是平滑的，也可以是直的(平滑的路径计算定义点周围的曲线路径，而直的路径只是从一个点到另一个点的直线)。

source: Pauses the time source and all of its children.
zh_cn: 暂停时间源及其所有子级。

source: Player id
zh_cn: 玩家id

source: Player preferences
zh_cn: 玩家偏好

source: Please note that although this function can be used to reference assets from strings (see example below) you should always make sure that the asset exists before using it otherwise you may get errors that will crash your game.
zh_cn: 注意，尽管此函数可以用于从字符串中引用资源(参见下面的例子)，但在使用它之前，你应该始终确保资源存在，否则你可能会出现错误，导致游戏崩溃。

source: Please note that as instances are sorted in an arbitrary manner, there is no specific order to how the instances are checked by this function, and any instance can be in any position.
zh_cn: 注意，由于实例是按任意方式排序的，因此此函数对实例的检查方式没有特定的顺序，任何实例都可以位于任何位置。

source: Please note that failure to remove fixtures after they are no longer needed may cause a memory leak which will slow down and eventually crash your game, so you should take care to clean up properly after defining and binding fixtures.
zh_cn: 注意，在它们不再需要后，如果不能删除它们，可能会导致内存泄漏，从而减慢速度并最终崩溃你的游戏，所以你应该注意在定义和绑定夹具后正确清理。

source: Please note that for changes in this variable to be visible, the instance should have either no draw event (and so GameMaker will default draw the sprite) or be drawn using one of the drawing functions like draw_self() or draw_sprite_ext() (by supplying the image_index into the appropriate argument).
zh_cn: 注意，要使该变量的变化可见，实例要么没有绘制事件(所以GameMaker将默认绘制精灵)，要么使用绘制函数之一绘制，如draw_self()或draw_sprite_ext()(通过向适当的参数提供image_index)。

source: Please note that for changes in this variable to be visible, the instance should have either no draw event (and so GameMaker will default draw the sprite) or be drawn using one of the extended drawing functions like draw_self() or draw_sprite_ext().
zh_cn: 注意，为了使这个变量的变化可见，实例应该没有绘制事件(所以GameMaker将默认绘制精灵)，或者使用一个扩展的绘制函数(如draw_self()或draw_sprite_ext())绘制。

source: Please note that for functions with 4 or more arguments, all of them must be of type ty_real.
zh_cn: 注意，对于具有4个或更多参数的函数，所有参数都必须为ty_real类型。

source: Please note that for the macOS target, you must have unchecked the "Start In Fullscreen" option and checked the "Allow the player to resize the game window" option in the Game Options, otherwise this function will fail.
zh_cn: 注意，对于macOS目标，你必须勾选"全屏开始"选项，并勾选"游戏选项"中的"允许玩家调整游戏窗口的大小"选项，否则此函数将失败。

source: Please note that if the instance running the code has the same object index as the object being checked, then it will be included in the check (this includes checks for parent objects if the calling instance is also a child of the parent).
zh_cn: 注意，如果运行代码的实例具有与被检查对象相同的对象索引，那么它将被包含在检查中(如果调用实例也是父对象的子对象，则这包括对父对象的检查)。

source: Please note that if you do not call surface_reset_target() after you have finished, nothing will be drawn on the screen as all further drawing (even in other instances) will be done on the surface.
zh_cn: 注意，如果在完成后不调用surface_reset_target()，屏幕上将不会绘制任何东西，因为所有进一步的绘制(甚至在其他实例中)都将在表面上完成。

source: Please note that should you need to get the unique instance id of the object being collided with, you should use instance_place().
zh_cn: 注意，如果您需要获得被碰撞对象的唯一实例id，您应该使用instance_place()。

source: Please note that the "x" value (the number to change) cannot be a negative value.
zh_cn: 注意，"x"值(要更改的数字)不能为负值。

source: Please note that the created path is empty ie: it has no points defined, so you will then have to use the other available functions to add points to the path or be using MP grids to generate the path.
zh_cn: 注意，创建的路径是空的，即:它没有定义点，因此您将必须使用其他可用的函数来添加点到路径或使用MP网格来生成路径。

source: Please note that the function may also return the constant pointer_null, in which case the current self is being used at the time of the call.
zh_cn: 注意，此函数还可能返回常量pointer_null，在这种情况下，调用时正在使用当前的self。

source: Please note that the line being drawn may need different values (+/-1 on the x, y) to be drawn with the desired dimensions due to differences across the various supported platforms.
zh_cn: 注意，由于各种支持平台之间的差异，绘制的线可能需要不同的值(x，y上的+/-1)来绘制所需的尺寸。

source: Please note that the physics world may present errors when instances are moved by directly setting this variable as it will interrupt the continuous simulation.
zh_cn: 注意，当通过直接设置此变量来移动实例时，物理世界可能会出现错误，因为这将中断连续模拟。

source: Please note that the position is based on the window, not the canvas, (0,0) position and that the sprite must be referenced directly from the texture page (see: sprite_get_tpe()).
zh_cn: 注意，位置是基于窗口，而不是画布(0,0)的位置，精灵必须直接从纹理页面引用(参见:sprite_get_tpe())。

source: Please note that the rectangle being drawn may need different values (+/-1 on the x, y, or width or height) to be drawn with the desired dimensions due to differences across the various supported platforms.
zh_cn: 使用此函数，您可以绘制矩形或填充矩形的轮廓，其中(x1,y1)位置是左上角，(x2,y2)位置是右下角。

source: Please note that there is no way to control the animation speed or image_index, so if the sprite has sub-images, these will be cycled at the same speed as the room speed.
zh_cn: 注意，没有办法控制动画速度或image_index，所以如果精灵有子图像，这些将以与房间速度相同的速度循环。

source: Please note that these are coordinates based on the surface size and not on the position at which the surface is being drawn in the room.
zh_cn: 注意，这些是基于表面大小的坐标，而不是基于房间中绘制表面的位置。

source: Please note that this function has the following restrictions:
zh_cn: 注意，此函数有以下限制:

source: Please note that this function is mainly for use with Android devices
zh_cn: 注意，此函数主要用于Android设备

source: Please note that this is an asynchronous function, ie: your game will continue to run in the background while the achievements page is being shown.
zh_cn: 注意，这是一个异步功能，即:你的游戏将继续在后台运行，而成就页面显示。

source: Please note that this is an asynchronous function, ie: your game will continue to run in the background while the leaderboards page is being shown.
zh_cn: 注意，这是一个异步功能，即:当排行榜页面显示时，你的游戏将继续在后台运行。

source: Please note that this is not an instance function!
zh_cn: 请注意，这不是实例函数！

source: Please note that this is not the same as deactivating the instance, as the instance is still visible on the screen and can still be changed through code, rather this function just prevents it from participating in the physics simulation
zh_cn: 注意，这与禁用实例不同，因为实例仍然在屏幕上可见，仍然可以通过代码进行更改，而此函数只是阻止它参与物理模拟

source: Please note that this is only a string and cannot be used to reference the font directly - for that you would need the font index.
zh_cn: 注意，这只是一个字符串，不能被用来直接引用字体-因为你需要字体索引。

source: Please note that this is only a string and cannot be used to reference the object directly - for that you would need the object index.
zh_cn: 注意，这只是一个字符串，不能被用来直接引用对象——因此你需要对象索引。

source: Please note that this is only a string and cannot be used to reference the path directly - for that you would need the path index ID.
zh_cn: 注意，这只是一个字符串，不能用来直接引用路径——为此，您需要路径索引ID。

source: Please note that this is only a string and cannot be used to reference the room directly - for that you would need the room index.
zh_cn: 注意，这只是一个字符串，不能被用来直接引用房间-因为你需要房间索引。

source: Please note that this is only a string and cannot be used to reference the sprite directly - for that you would need the sprite index.
zh_cn: 注意，这只是一个字符串，不能用来直接引用精灵-为此，你需要精灵索引。

source: Please note that this is only a string and cannot be used to reference the tile set directly - for that you would need the tile set index.
zh_cn: 注意，这只是一个字符串，不能用来直接引用图块集——为此，您需要图块集索引。

source: Please note that this is only a string and cannot be used to reference the timeline directly - for that you would need the timeline index.
zh_cn: 注意，这只是一个字符串，不能用来直接引用时间线，因为你需要时间线索引。

source: Please note that this will have no visible effect in-game if the instance following the path being shifted follows it relatively (rather than absolutely) as the path's position is disregarded then.
zh_cn: 注意，这在游戏中没有明显的效果，如果跟随路径移动的实例相对地(而不是绝对地)跟随它，因为路径的位置被忽略了。

source: Please note that to start drawing to a surface you must first have called the function surface_set_target() and then this one after you have finished, for each surface target that you have set or else nothing will be drawn on the screen as all further drawing (even in other instances) will be done on the surface.
zh_cn: 注意，要开始绘制一个表面，你必须首先调用函数surface_set_target()，然后在你完成之后调用此函数，对于你设置的每个表面目标，否则屏幕上不会绘制任何东西，因为所有进一步的绘制(甚至在其他实例中)都将在表面上完成。

source: Please note that when the instance has no sprite assigned the value returned will be the same as the instance X position.
zh_cn: 注意，当实例没有分配精灵时，返回值将与实例X位置相同。

source: Please note that when the instance has no sprite assigned the value returned will be the same as the instance Y position.
zh_cn: 注意，当实例没有分配精灵时，返回值将与实例Y位置相同。

source: Please note that when there is (for example) 1 sub-image this variable will return "1" but the image_index of that sub-image is 0.
zh_cn: 注意，当有(例如)一个子图像时，该变量将返回"1"，但该子图像的image_index为0。

source: Please note the following:
zh_cn: 注意以下几点:

source: Please note, that if you choose not to perform the Destroy, Clean Up and Create events, any instance created that uses a variable normally defined in the create event will crash the game as that variable will no longer exist.
zh_cn: 注意，如果你选择不执行销毁，清理和创建事件，任何使用创建事件中正常定义的变量创建的实例将使游戏崩溃，因为该变量将不再存在。

source: Please note, that the value used for checking must have been initialised previously or else you will get an error causing GameMaker to close.
zh_cn: 注意，用于检查的值必须在之前初始化，否则你会得到一个错误，导致GameMaker关闭。

source: Please note, that when using the random number functions in GameMaker the initial seed is always the same, as this makes tracing errors and debugging far easier.
zh_cn: 注意，当在GameMaker中使用随机数函数时，初始种子总是相同的，因为这使得跟踪错误和调试更加容易。

source: Powder particles produce a scattering effect such as you might see with sand or dust.
zh_cn: 粉末颗粒产生散射效果，就像你在沙子或灰尘中看到的那样。

source: Preferences can only be set after joining or creating a game, but before starting the game.
zh_cn: 只能在加入或创建游戏之后，但在开始游戏之前设置首选项。

source: Push Notification event
zh_cn: 推送通知事件

source: Read-only files
zh_cn: 只读文件

source: Real numbers can also be used as input arguments.
zh_cn: 实数也可以用作输入参数。

source: Reducing this value means that the instance will start changing direction later as it doesn't "see" as far ahead, and increasing it means it will start changing direction earlier.
zh_cn: 减小该值意味着实例将在稍后开始改变方向，因为它不会"看到"很远的距离，增加它意味着它将更早开始改变方向。

source: Regardless of the sprite being replaced, this function will create a new texture page for the sprite and so care should be taken when using it as it may adversely affect performance by increasing the number of required texture swaps for rendering.
zh_cn: 不管子画面被替换，此函数将为子画面创建一个新的纹理页面，所以使用它时要小心，因为它可能会增加渲染所需的纹理交换次数，从而对性能产生负面影响。

source: Remember that in GameMaker (unless you are using physics) the angles are calculated counter-clockwise, so rotating the path by 90 degrees would rotate the path to the left.
zh_cn: 记住，在GameMaker中(除非你使用的是物理)角度是逆时针计算的，所以将路径旋转90度将使路径向左旋转。

source: Remember that in GameMaker (unless you are using physics) the angles are calculated counter-clockwise, so setting the path orientation to 90° would rotate the path to the left.
zh_cn: 请记住，在GameMaker中(除非您使用物理)，角度是逆时针计算的，因此将路径方向设置为90°会将路径向左旋转。

source: Remember that this is different to string_width() in that it measures the number of characters in the string, not its width as drawn on the screen in pixels.
zh_cn: 请记住，这与string_width()不同，它度量的是字符串中的字符数，而不是它在屏幕上以像素为单位绘制的宽度。

source: Remember, a sprite sub-image starts being numbered from 0, so if this function returns 3 (the sprite being checked has 3 sub-images) they will be numbered 0, 1 and 2.
zh_cn: 记住，一个精灵子图像从0开始编号，所以如果此函数返回3(被检查的精灵有3个子图像)，它们将被编号为0、1和2。

source: Removes empty entries from the output array.
zh_cn: 从输出数组中删除空项。

source: Resets and reconfigures the time source.
zh_cn: 重置和重新配置时间源。

source: Resets the time source and all of its children.
zh_cn: 重置时间源及其所有子节点。

source: Restitution is usually set as a value between 0 and 1, but you can use higher values if required, although the results may be unpredictable.
zh_cn: 恢复通常设置为0到1之间的值，但是如果需要，您可以使用更高的值，尽管结果可能是不可预测的。

source: Resumes a time source and all of its children.
zh_cn: 恢复一个时间源及其所有子级。

source: Returns a handle which can be used to cancel the call.
zh_cn: 返回可用于取消调用的句柄。

source: Returns an array containing all of the indexes of the children of this time source.
zh_cn: 返回一个数组，该数组包含此时间源的所有子对象的索引。

source: Returns an array of instances that it has collided with.
zh_cn: 返回与其发生冲突的实例数组。

source: Returns if the filter or effect is forced on a single layer.
zh_cn: 返回如果滤镜或效果被强加在一个层上。。

source: Returns the current active state of the time source.
zh_cn: 返回时间源的当前活动状态。

source: Returns the date value of the given datetime.
zh_cn: 返回给定日期时间的日期值。

source: Returns the date-time value of the current moment.
zh_cn: 返回当前时刻的日期时间值。

source: Returns the floor of n, that is, n rounded down to an integer.
zh_cn: 返回n的底数，也就是说，将n四舍五入到整数。

source: Returns the height of the texture with the given id, which is always a value within the range 0 - 1.
zh_cn: 用给定的id返回纹理的高度，它总是在0 - 1范围内的值。

source: Returns the index of the parent of this time source.
zh_cn: 返回此时间源的父对象的索引。

source: Returns the inverse cosine of x, in that if cos(val)=n, arccos(n)=val, and the resulting number will be between pi and 0.
zh_cn: 返回x的反余弦函数，如果cos(val)=n, arccos(n)=val，则得到的值将在pi和0之间。

source: Returns the inverse cosine of x, in that if dcos(val)=n, darccos(n)=val, and the resulting number will be between 180 and 0.
zh_cn: 返回x的反余弦值，因为如果dcos(val)=n，darccos(n)=val，则结果数将介于180和0之间。

source: Returns the inverse sine of x, in that if dsin(x)=n, darcsin(n)=x, and the resulting number will be between -90 and 90.
zh_cn: 返回x的反正弦值，因为如果dsin(x)=n，darcsin(n)=x，则得到的数字将介于-90和90之间。

source: Returns the inverse sine of x, in that if sin(x)=n, arcsin(n)=x, and the resulting number will be between -pi/2 and pi/2.
zh_cn: 返回x的反正弦值，如果sin(x)=n, arcsin(n)=x，则得到的数值将在-pi/2 和 pi/2之间。

source: Returns the inverse tangent of x.
zh_cn: 返回x的反正切值。

source: Returns the number of repetitions the time source has completed so far.
zh_cn: 返回时间源到目前为止已完成的重复次数。

source: Returns the number of repetitions the time source has left to complete.
zh_cn: 返回时间源还未完成的重复次数。

source: Returns the period of the time source, measured in its own units.
zh_cn: 返回时间源的周期，以其自身的单位度量。

source: Returns the raw byte value as a real value at a given position in the given string.
zh_cn: 在给定字符串中的给定位置，将原始字节值作为实数值返回。

source: Returns the time left before the next expiry of the time source, measured in its own units.
zh_cn: 返回时间源下一次到期前剩下的时间，以其自身的单位度量。

source: Returns the time value of the given datetime.
zh_cn: 返回给定日期时间的时间值。

source: Returns the units that the time source is measuring in.
zh_cn: 返回时间源的度量单位。

source: Returns the width of the texture with the given id, which is always a value within the range 0 - 1.
zh_cn: 用给定的id返回纹理的宽度，它总是在0 - 1范围内的值。

source: Returns true if successful, false if the current frame will be rerun.
zh_cn: 如果成功，则返回true如果将重新运行当前帧，则返回false。

source: Returns true if the given index corresponds to an existing time source.
zh_cn: 如果给定的索引对应于现有的时间源，则返回true。

source: Reverberation, an echo.
zh_cn: 混响，回声。

source: Right button held down anywhere
zh_cn: 在任何地方按住右键

source: Right button held down on object
zh_cn: 在对象上按住右键

source: Right button just pressed anywhere
zh_cn: 在任何地方按下右键按钮

source: Right button just pressed on object
zh_cn: 在对象上按下右键

source: Right button just released anywhere
zh_cn: 在任何地方释放右键

source: Right button just released on object
zh_cn: 在对象上释放右键

source: Right shoulder button
zh_cn: 右肩按钮

source: Right shoulder trigger
zh_cn: 右肩触发

source: Right stick horizontal axis (analog)
zh_cn: 右斗杆水平轴(模拟)

source: Right stick vertical axis (analog)
zh_cn: 右斗杆垂直轴(模拟)

source: Rigid particle groups are ones whose shape does not change, even when they collide with other fixtures.
zh_cn: 刚性粒子组是那些形状不变的粒子组，即使它们与其他设备碰撞时也是如此。

source: Safari on a mobile device
zh_cn: 移动设备上的Safari

source: Save/Load Event
zh_cn: 保存/加载事件

source: See audio_listener_position() for more information), so for example if the emitter position is set to (100, 0, 0) and the current listener is at (200, 0, 0) the audio streamed from the emitter will appear to be on the left of the audio field.
zh_cn: 有关详细信息，请参见audio_listener_position()，因此，例如，如果发射器位置设定为(100，0，0)，并且当前收听者位于(200，0，0)，则从发射器流出的音频将出现在音频场的左侧。

source: See draw_primitive_begin() for more information.
zh_cn: 更多信息请参见draw_primitive_begin()。

source: See gpu_push_state() for more information.
zh_cn: 更多信息请参见gpu_push_state()。

source: See layer_force_draw_depth() for more information.
zh_cn: 更多信息请参见layer_force_draw_depth()。

source: See layer_set_target_room() for more information.
zh_cn: 有关详细信息，请参见layer_set_target_room()。

source: See the example code below.
zh_cn: 参见下面的示例代码。

source: See the function description for more information.
zh_cn: 更多信息请参见函数描述。

source: See the function layer_set_target_room() for further information.
zh_cn: 更多信息见函数layer_set_target_room()。

source: See the image below for details:
zh_cn: 详情见下图:

source: See the image below to get an idea of the difference between orthographic and perspective views.
zh_cn: 查看下图，了解正交视图和透视视图之间的区别。

source: See the section on Audio Listeners for more information.
zh_cn: 请参见音频一节，有关更多信息。

source: See this page for information on Nine Slice.
zh_cn: 有关九宫格信息，请参见本页。

source: See this page for more information.
zh_cn: 有关更多信息，请参见本页。

source: Send a BINARY message over WeSocket
zh_cn: 通过WeSocket发送一个二进制消息

source: Send a TEXT message over WebSocket
zh_cn: 通过WebSocket发送文本消息

source: Separation and width can be set to -1 to get the default spacing.
zh_cn: 分割和宽度可以设置为-1以获得默认间距。

source: Set a connection timeout value
zh_cn: 设置连接超时值

source: Set as proportional font or not.
zh_cn: 是否设置成比例字体。

source: Set double-click detection on (true) or off (false).
zh_cn: 设置双击检测为开启(true)或关闭(false)。

source: Set loop enable or disable.
zh_cn: 设置循环启用或禁用。

source: Set the channel priority for the sound.
zh_cn: 为声音设置通道优先级。

source: Set the cohesion strength between particles in the group.
zh_cn: 设置组中粒子之间的内聚强度。

source: Set the inertia for the fixture.
zh_cn: 设置夹具的惯性。

source: Set the path or url to the video.
zh_cn: 设置视频的路径或url。

source: Set the position in milliseconds.
zh_cn: 以毫秒为单位设置位置。

source: Set the protocol to use on websocket upgrade message, protocol is a string as 3rd parameter
zh_cn: 设置websocket升级消息使用的协议，协议是一个字符串作为第三个参数

source: Set the value to true to enable or false to disable.
zh_cn: 将该值设置为true可启用，设置为false可禁用。

source: Set the velocity ratio between the two joints
zh_cn: 设置两个关节之间的速度比

source: Set the velocity ratio between two instances
zh_cn: 设置两个实例之间的速度比

source: Set this to true for "on" and false for "off"
zh_cn: 将on设为真，off设为假

source: Set this variable to 0 to reset the sprite to be drawn as was defined in the sprite editor.
zh_cn: 将此变量设置为0将重置要绘制的精灵，就像在精灵编辑器中定义的那样。
